In [2]:
import pandas as pd

In [3]:
x = pd.read_csv("Student.csv")

In [4]:
x.head()

    Name  Class    no.  age gender   weight Married
0  Abhay      11  9909   20    male     187      no
1  Sumit      12  3674   19    male     156     yes
2    Raj      11  7895   17    male     145     yes
3   Ajay      10  6785   16    male     134      no
4   Anuj       9  8965   20    male     176      no

In [5]:
x.isnull().sum()

Name       0
Class      0
no.        0
age        0
gender     0
weight     0
Married    0
dtype: int64

In [6]:
en_data = x[["Married"]]
en_data

  Married
0      no
1     yes
2     yes
3      no
4      no
5     yes
6      no
7     yes

In [7]:
pd.get_dummies(en_data)

   Married_no  Married_yes
0        True        False
1       False         True
2       False         True
3        True        False
4        True        False
5       False         True
6        True        False
7       False         True

In [8]:
pd.get_dummies(en_data).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Married_no   8 non-null      bool
 1   Married_yes  8 non-null      bool
dtypes: bool(2)
memory usage: 148.0 bytes

In [9]:
from sklearn.preprocessing import OneHotEncoder

In [18]:
ohe = OneHotEncoder(drop="first")

In [19]:
ar =ohe.fit_transform(en_data).toarray()

In [21]:
pd.DataFrame(ar,columns=["Married_yes"])

   Married_yes
0          0.0
1          1.0
2          1.0
3          0.0
4          0.0
5          1.0
6          0.0
7          1.0

#label encoding

In [23]:
df = pd.DataFrame(({"name" : ["dog","cat","black","yellow","rat"]}))

In [24]:
df

     name
0     dog
1     cat
2   black
3  yellow
4     rat